# Задача 28: Напишите рекурсивную функцию sum(a, b),
# возвращающую сумму двух целых неотрицательных чисел. Из
# всех арифметических операций допускаются только +1 и -1.
# Также нельзя использовать циклы.
#
# a = 2
# b = 2
# def sum(a,b):
#     if a and b > 1:
#         return a+b
# sum(a,b)
# print(sum(a,b))
#
a = 3
b = 5
def sum(a, b):
    if a and b > 1:
        return a+b
sum(a, b)
print(sum(a, b))
#
# print(sum(a = 2, b = 2))